Tekla Open API Reference for Tekla Structures 2025
Intersection.PlaneToPlane Method
 Returns a new line which is an intersection of the given two planes or null if the planes are parallel.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Line PlaneToPlane(
	GeometricPlane plane1,
	GeometricPlane plane2
)
Public Shared Function PlaneToPlane (
	plane1 As GeometricPlane,
	plane2 As GeometricPlane
) As Line
Parameters
plane1
Type: Tekla.Structures.Geometry3d.GeometricPlane
The first plane to be used.
plane2
Type: Tekla.Structures.Geometry3d.GeometricPlane
The second plane to be used.
Return Value
Type: Line
The intersection line or null if no intersection was found.
See Also
Reference
Intersection Class
Tekla.Structures.Geometry3d Namespace